In [ ]:
############# pandas 4강 - DataFrame 데이터 분석용 함수 사용하기

In [152]:
data = [[1.4, np.nan],
           [7.1, -4.5],
        [np.nan, np.nan],
        [0.75, -1.3]]
df = pd.DataFrame(data, columns=["one", "two"], index=["a", "b", "c", "d"])

In [153]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [160]:
df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [161]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [165]:
df["one"].sum()

9.25

In [168]:
df.loc["b"].sum()

2.5999999999999996

In [170]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [171]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [172]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [173]:
one_mean = df.mean(axis=0)["one"]

In [174]:
two_mean = df.mean(axis=0)["two"]

In [176]:
df["one"] = df["one"].fillna(value=one_mean)

In [177]:
df["two"] = df["two"].fillna(value=two_mean)

In [178]:
df

        one  two       onw
a  1.400000 -2.9  1.400000
b  7.100000 -4.5  7.100000
c  3.083333 -2.9  3.083333
d  0.750000 -1.3  0.750000

In [180]:
df.drop(["onw"],axis=1)

        one  two
a  1.400000 -2.9
b  7.100000 -4.5
c  3.083333 -2.9
d  0.750000 -1.3

In [181]:
df

        one  two       onw
a  1.400000 -2.9  1.400000
b  7.100000 -4.5  7.100000
c  3.083333 -2.9  3.083333
d  0.750000 -1.3  0.750000

In [184]:
df

        one  two
a  1.400000 -2.9
b  7.100000 -4.5
c  3.083333 -2.9
d  0.750000 -1.3

In [186]:
df2 = pd.DataFrame(np.random.randn(6, 4),
                   columns=["A", "B", "C", "D"],
                   index=pd.date_range("20160701", periods=6))

In [188]:
df2["A"].corr(df2["B"])   ##피어슨상관계수

-0.045972655990169503

In [190]:
df2["B"].cov(df2["C"])    ##공분산

0.1432163174167346

In [191]:
df2.corr()

          A         B         C         D
A  1.000000 -0.045973 -0.193459 -0.453844
B -0.045973  1.000000  0.198229 -0.220824
C -0.193459  0.198229  1.000000 -0.601438
D -0.453844 -0.220824 -0.601438  1.000000

In [192]:
df2.cov()

          A         B         C         D
A  1.205006 -0.039716 -0.194958 -0.387648
B -0.039716  0.619353  0.143216 -0.135223
C -0.194958  0.143216  0.842779 -0.429620
D -0.387648 -0.135223 -0.429620  0.605443

In [193]:
dates = df2.index
random_dates = np.random.permutation(dates)
df2 = df2.reindex(index=random_dates, columns=["D", "B", "C", "A"])

In [194]:
df2

                   D         B         C         A
2016-07-02  1.213294  0.320228 -1.354051 -0.992459
2016-07-01  0.458853 -0.024131 -0.863726  1.710252
2016-07-05 -0.399311 -0.209385  0.862513 -0.367889
2016-07-03  0.080811  1.223526  0.963502 -0.500403
2016-07-06 -1.023994  1.404091 -0.114799  1.311701
2016-07-04  0.492697  1.613281 -0.082517 -0.345824

In [196]:
df2.sort_index(axis=0)

                   D         B         C         A
2016-07-01  0.458853 -0.024131 -0.863726  1.710252
2016-07-02  1.213294  0.320228 -1.354051 -0.992459
2016-07-03  0.080811  1.223526  0.963502 -0.500403
2016-07-04  0.492697  1.613281 -0.082517 -0.345824
2016-07-05 -0.399311 -0.209385  0.862513 -0.367889
2016-07-06 -1.023994  1.404091 -0.114799  1.311701

In [197]:
df2

                   D         B         C         A
2016-07-02  1.213294  0.320228 -1.354051 -0.992459
2016-07-01  0.458853 -0.024131 -0.863726  1.710252
2016-07-05 -0.399311 -0.209385  0.862513 -0.367889
2016-07-03  0.080811  1.223526  0.963502 -0.500403
2016-07-06 -1.023994  1.404091 -0.114799  1.311701
2016-07-04  0.492697  1.613281 -0.082517 -0.345824

In [200]:
df2.sort_index(axis=1)   ##오름차순

                   A         B         C         D
2016-07-02 -0.992459  0.320228 -1.354051  1.213294
2016-07-01  1.710252 -0.024131 -0.863726  0.458853
2016-07-05 -0.367889 -0.209385  0.862513 -0.399311
2016-07-03 -0.500403  1.223526  0.963502  0.080811
2016-07-06  1.311701  1.404091 -0.114799 -1.023994
2016-07-04 -0.345824  1.613281 -0.082517  0.492697

In [202]:
df2.sort_index(axis=0, ascending=False)

                   D         B         C         A
2016-07-06 -1.023994  1.404091 -0.114799  1.311701
2016-07-05 -0.399311 -0.209385  0.862513 -0.367889
2016-07-04  0.492697  1.613281 -0.082517 -0.345824
2016-07-03  0.080811  1.223526  0.963502 -0.500403
2016-07-02  1.213294  0.320228 -1.354051 -0.992459
2016-07-01  0.458853 -0.024131 -0.863726  1.710252

In [203]:
df2.sort_index(axis=1, ascending=False)

                   D         C         B         A
2016-07-02  1.213294 -1.354051  0.320228 -0.992459
2016-07-01  0.458853 -0.863726 -0.024131  1.710252
2016-07-05 -0.399311  0.862513 -0.209385 -0.367889
2016-07-03  0.080811  0.963502  1.223526 -0.500403
2016-07-06 -1.023994 -0.114799  1.404091  1.311701
2016-07-04  0.492697 -0.082517  1.613281 -0.345824

In [204]:
df2

                   D         B         C         A
2016-07-02  1.213294  0.320228 -1.354051 -0.992459
2016-07-01  0.458853 -0.024131 -0.863726  1.710252
2016-07-05 -0.399311 -0.209385  0.862513 -0.367889
2016-07-03  0.080811  1.223526  0.963502 -0.500403
2016-07-06 -1.023994  1.404091 -0.114799  1.311701
2016-07-04  0.492697  1.613281 -0.082517 -0.345824

In [206]:
df2.sort_values(by="D")

                   D         B         C         A
2016-07-06 -1.023994  1.404091 -0.114799  1.311701
2016-07-05 -0.399311 -0.209385  0.862513 -0.367889
2016-07-03  0.080811  1.223526  0.963502 -0.500403
2016-07-01  0.458853 -0.024131 -0.863726  1.710252
2016-07-04  0.492697  1.613281 -0.082517 -0.345824
2016-07-02  1.213294  0.320228 -1.354051 -0.992459

In [207]:
df2.sort_values(by="B", ascending=False)

                   D         B         C         A
2016-07-04  0.492697  1.613281 -0.082517 -0.345824
2016-07-06 -1.023994  1.404091 -0.114799  1.311701
2016-07-03  0.080811  1.223526  0.963502 -0.500403
2016-07-02  1.213294  0.320228 -1.354051 -0.992459
2016-07-01  0.458853 -0.024131 -0.863726  1.710252
2016-07-05 -0.399311 -0.209385  0.862513 -0.367889

In [208]:
df2["E"] = np.random.randint(0, 6, size=6)
df2["F"] = ["alpha", "beta", "gamma", "gamma", "alpha", "gamma"]

In [209]:
df2

                   D         B         C         A  E      F
2016-07-02  1.213294  0.320228 -1.354051 -0.992459  4  alpha
2016-07-01  0.458853 -0.024131 -0.863726  1.710252  1   beta
2016-07-05 -0.399311 -0.209385  0.862513 -0.367889  5  gamma
2016-07-03  0.080811  1.223526  0.963502 -0.500403  3  gamma
2016-07-06 -1.023994  1.404091 -0.114799  1.311701  0  alpha
2016-07-04  0.492697  1.613281 -0.082517 -0.345824  0  gamma

In [210]:
df2.sort_values(by=["E","F"])

                   D         B         C         A  E      F
2016-07-06 -1.023994  1.404091 -0.114799  1.311701  0  alpha
2016-07-04  0.492697  1.613281 -0.082517 -0.345824  0  gamma
2016-07-01  0.458853 -0.024131 -0.863726  1.710252  1   beta
2016-07-03  0.080811  1.223526  0.963502 -0.500403  3  gamma
2016-07-02  1.213294  0.320228 -1.354051 -0.992459  4  alpha
2016-07-05 -0.399311 -0.209385  0.862513 -0.367889  5  gamma

In [211]:
df2["F"].unique()

array(['alpha', 'beta', 'gamma'], dtype=object)

In [214]:
df2["F"].value_counts()

gamma    3
alpha    2
beta     1
Name: F, dtype: int64

In [215]:
df2["F"].isin(["alpha","beta"])

2016-07-02     True
2016-07-01     True
2016-07-05    False
2016-07-03    False
2016-07-06     True
2016-07-04    False
Name: F, dtype: bool

In [217]:
df2.loc[df2["F"].isin(["alpha","beta"]), :]

                   D         B         C         A  E      F
2016-07-02  1.213294  0.320228 -1.354051 -0.992459  4  alpha
2016-07-01  0.458853 -0.024131 -0.863726  1.710252  1   beta
2016-07-06 -1.023994  1.404091 -0.114799  1.311701  0  alpha

In [218]:
df3 = pd.DataFrame(np.random.randn(4, 3), columns=["b", "d", "e"],
                   index=["Seoul", "Incheon", "Busan", "Daegu"])

In [219]:
df3

                b         d         e
Seoul    0.437995 -1.250996 -0.200035
Incheon -2.988379  0.474609  0.363563
Busan    0.713328  0.435466 -0.336052
Daegu    0.208471 -0.318063  0.320114

In [220]:
func = lambda x: x.max() - x.min()

In [223]:
df3.apply(func, axis=0)

b    3.701707
d    1.725605
e    0.699615
dtype: float64

In [224]:
df3.apply(func, axis=1)

Seoul      1.688991
Incheon    3.462988
Busan      1.049379
Daegu      0.638177
dtype: float64